{
  "partie": "6. Documentation et Livraison",
  "sous_partie": "6.1. Documentation Technique",
  "taches": [
    {
      "titre": "6.1.1 Générer la documentation API (OpenAPI/Swagger)",
      "sous_taches": [
        {
          "titre": "6.1.1.1 Lister tous les endpoints API",
          "description": "Recenser tous les endpoints RESTful exposés par le backend (routes Laravel)."
        },
        {
          "titre": "6.1.1.2 Documenter chaque endpoint dans OpenAPI",
          "description": "Décrire chaque endpoint (méthode, params, body, réponses, erreurs) dans un fichier openapi.json. Utiliser des outils comme Laravel OpenAPI si besoin."
        },
        {
          "titre": "6.1.1.3 Générer la documentation interactive Swagger",
          "description": "Générer la doc interactive (Swagger UI) à partir du fichier OpenAPI et la rendre accessible (ex: /api/docs)."
        },
        {
          "titre": "6.1.1.4 Vérifier la complétude et la cohérence de la doc API",
          "description": "S'assurer que tous les endpoints sont couverts, que les exemples sont présents, et que la doc est à jour avec le code."
        }
      ]
    },
    {
      "titre": "6.1.2 Générer les guides d'installation, contribution, utilisateur",
      "sous_taches": [
        {
          "titre": "6.1.2.1 Rédiger INSTALL.md",
          "description": "Rédiger un guide d'installation détaillé (prérequis, setup backend/frontend, variables d'env, commandes, erreurs courantes)."
        },
        {
          "titre": "6.1.2.2 Rédiger CONTRIBUTING.md",
          "description": "Rédiger un guide de contribution (workflow Git, conventions, tests, checklist, bonnes pratiques, code review)."
        },
        {
          "titre": "6.1.2.3 Rédiger les guides utilisateurs",
          "description": "Rédiger un ou plusieurs guides pour les utilisateurs finaux (navigation, fonctionnalités, FAQ, accès, gestion des droits, etc.)."
        },
        {
          "titre": "6.1.2.4 Ajouter des exemples et captures d'écran",
          "description": "Illustrer les guides avec des exemples concrets, captures d'écran, schémas, liens utiles."
        },
        {
          "titre": "6.1.2.5 Vérifier la clarté et l'accessibilité des guides",
          "description": "Faire relire les guides, vérifier la clarté, la structure, la langue, et l'accessibilité (formats, navigation)."
        }
      ]
    },
    {
      "titre": "6.1.3 Vérification de la sous-partie",
      "sous_taches": [
        {
          "titre": "6.1.3.1 Vérifier la complétion de toutes les tâches précédentes",
          "description": "S'assurer que la doc API et les guides sont complets, à jour, accessibles et validés."
        },
        {
          "titre": "6.1.3.2 Faire relire la documentation par un tiers",
          "description": "Demander une relecture externe pour valider la qualité, la cohérence et la compréhension de la documentation."
        }
      ]
    },
    {
      "titre": "6.1.4 Log de la sous-partie",
      "sous_taches": [
        {
          "titre": "6.1.4.1 Consigner le log de la sous-partie",
          "description": "Consigner dans logs.txt un résumé daté de toutes les actions réalisées dans cette sous-partie, en listant les fichiers créés, modifiés, et l'état de la documentation."
        }
      ]
    }
  ]
}
